{
  "source": "SpaceNews",
  "url": "https://spacenews.com/maxar-signs-agreement-with-umbra-for-direct-access-to-radar-imaging-satellites/",
  "title": "Maxar signs agreement with Umbra for direct access to radar imaging satellites",
  "published_date": "2023-02-14",
  "section": "Commercial Space",
  "is_relevant": true,
  "relevance_score": 0.9,
  "deal_type": "partnership",
  "deal_status": "announced",
  "acquirer": null,
  "target": null,
  "investors": [],
  "amount": null,
  "currency": null,
  "valuation": null,
  "stake_percent": null,
  "key_assets": [
    "dedicated access to Umbra’s SAR satellite constellation",
    "integration of SAR data into Maxar’s Earth intelligence products",
    "assured access to Umbra’s next two satellites (6 and 7)"
  ],
  "geography": [
    "United States"
  ],
  "summary": "Maxar has signed a non-exclusive, multi-year partnership agreement with Umbra to gain dedicated access to Umbra’s synthetic aperture radar (SAR) satellite constellation. The deal allows Maxar to directly task Umbra’s satellites and integrate SAR data into its Earth intelligence portfolio, complementing its high-resolution optical imagery. The combined optical-SAR products are expected to be available in Q2 2023 and fully integrated by 2024. Umbra will provide assured access to its next two satellites, with plans to expand its constellation to 24 satellites.",
  "why_it_matters": "This partnership enhances Maxar’s multi-source intelligence capabilities by combining high-resolution optical and SAR data, addressing growing demand from intelligence agencies and military commands for all-weather, day-night imaging. It also strengthens Umbra’s commercial business case and positions it as a key SAR provider alongside competitors like Capella Space and ICEYE.",
  "entities": [
    {
      "name": "Maxar",
      "role": "acquirer_of_services",
      "type": "company"
    },
    {
      "name": "Umbra",
      "role": "service_provider",
      "type": "company"
    },
    {
      "name": "ICEYE",
      "role": "mentioned_competitor",
      "type": "company"
    },
    {
      "name": "Capella Space",
      "role": "mentioned_competitor",
      "type": "company"
    }
  ]
}