{
  "source": "SpaceNews",
  "url": "https://spacenews.com/iceye-to-develop-sar-constellation-for-uae/",
  "title": "Iceye to develop SAR constellation for UAE",
  "published_date": "2023-05-17",
  "section": "Commercial Space",
  "is_relevant": true,
  "relevance_score": 0.95,
  "deal_type": "contract",
  "deal_status": "announced",
  "acquirer": null,
  "target": null,
  "investors": [],
  "amount": null,
  "currency": null,
  "valuation": null,
  "stake_percent": null,
  "key_assets": [
    "five-satellite SAR constellation",
    "ground segment",
    "mission control center (computers, antennas, software)",
    "access to Iceye’s existing constellation data"
  ],
  "geography": {
    "primary": "United Arab Emirates",
    "secondary": "Finland"
  },
  "summary": "Iceye, a Finland-based synthetic aperture radar (SAR) satellite operator, has signed an agreement with UAE geospatial analysis firm Bayanat and Emirati fleet operator Yahsat to develop a five-satellite SAR constellation for the UAE. The first satellite is scheduled to launch in Q1 2024. Iceye will provide satellites, ground services, and mission control infrastructure, while also granting Bayanat access to its existing constellation data. The partnership aims to establish a sovereign Earth-observation ecosystem in the UAE, supporting public and private sector applications.",
  "why_it_matters": "This deal marks a significant expansion of Iceye’s presence in the Middle East and North Africa (MENA) region, strengthening the UAE’s sovereign Earth-observation capabilities. It also highlights the growing commercial demand for SAR satellite data, which can operate in all weather conditions and at any time of day. The collaboration aligns with the UAE’s broader strategy to develop a competitive space sector and foster economic growth through advanced geospatial technologies.",
  "entities": [
    {
      "name": "ICEYE",
      "role": "provider",
      "type": "company"
    },
    {
      "name": "Bayanat",
      "role": "customer",
      "type": "company"
    },
    {
      "name": "Yahsat",
      "role": "partner",
      "type": "company"
    },
    {
      "name": "UAE",
      "role": "geography",
      "type": "country"
    },
    {
      "name": "Finland",
      "role": "geography",
      "type": "country"
    }
  ]
}